oliviertassinari/plume/soft/receiver/ble_sdk_and_doc/ble_sdk_5.2.0/nrf51822/Board/nrf6310/s120/experimental/common/ble_db_discovery.c
/* Copyright (c) 2013 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 */

/**@cond To Make Doxygen skip documentation generation for this file.
 * @{
 */

#include "ble_db_discovery.h"
#include "nrf_error.h"
#include "ble.h"
#include "debug.h"
#include "nordic_common.h"
#include <stdlib.h>
#include <string.h>

#define SRV_DISC_START_HANDLE         0x0001                        /**< Start handle value used during service discovery. */
#define DB_DISCOVERY_MAX_USERS        BLE_DB_DISCOVERY_MAX_SRV      /**< Maximum number of users/registrations allowed by this module. */
#define DB_LOG                        debug_log                     /**< Macro used for debug logging. */

/**@brief Array of structures containing information about the registered application modules. */
static struct
{
    ble_uuid_t                        srv_uuid;                     /**< UUID of the service for which the application module had registered itself.*/
    ble_db_discovery_evt_handler_t    evt_handler;                  /**< Event handler of the application module to be called in case there are any events.*/
} m_registered_modules[DB_DISCOVERY_MAX_USERS];

/**@brief   Array of structures containing events pending to be sent to the application modules.
 *
 * @details Whenever a discovery related event is to be raised to a user module, it shall be stored
 *          first in this array. And only when all services needed to be discovered have been
 *          discovered, all pending events will be sent to the corresponding user modules.
 **/
static struct
{
    ble_db_discovery_evt_t            evt;                          /**< The pending event. */
    ble_db_discovery_evt_handler_t    evt_handler;                  /**< The event handler which should be called to raise this event. */
} m_pending_user_evts[DB_DISCOVERY_MAX_USERS];

static uint8_t                        m_pending_usr_evt_index;      /**< The index to the pending user event array pointing to the last added pending user event. */
static uint8_t                        m_num_of_modules_reg;         /**< Number of modules registered with the DB Discovery module. */
static uint8_t                        m_num_of_discoveries_made;    /**< Variable indicating the total number of service discoveries made at a given instant. Used by the module to determine if all required service discoveries are made. Even if a service was not present at the peer, this variable will be incremented. */
static bool                           m_initialized = false;        /**< Variable to indicate if the module is initialized or not. */

/**@brief     Function for fetching the event handler provided by a registered application module.
 *
 * @param[in] srv_uuid UUID of the service.
 *
 * @retval    Event handler of the module registered for the given service UUID.
 * @retval    NULL if no event handler is found.
 */
static ble_db_discovery_evt_handler_t registered_handler_get(ble_uuid_t * p_srv_uuid)
{
    uint8_t i;

    for (i = 0; i < m_num_of_modules_reg; i++)
    {
        if (BLE_UUID_EQ(&(m_registered_modules[i].srv_uuid), p_srv_uuid))
        {
            return (m_registered_modules[i].evt_handler);
        }
    }

    return NULL;
}


/**@brief     Function for storing the event handler provided by a registered application module.
 *
 * @param[in] p_srv_uuid    UUID of the service.
 * @param[in] p_evt_handler Event handler provided by the application.
 *
 * @retval    NRF_SUCCESS if the handler was stored.
 * @retval    NRF_ERROR_NO_MEM if there is no space left to store the handler.
 */
static uint32_t registered_handler_set(const ble_uuid_t * const       p_srv_uuid,
                                       ble_db_discovery_evt_handler_t p_evt_handler)
{
    if (m_num_of_modules_reg < DB_DISCOVERY_MAX_USERS)
    {
        m_registered_modules[m_num_of_modules_reg].srv_uuid    = *p_srv_uuid;
        m_registered_modules[m_num_of_modules_reg].evt_handler = p_evt_handler;

        m_num_of_modules_reg++;

        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_NO_MEM;
    }
}


/**@brief     Function for sending all pending discovery related events to the corresponding user
 *            modules.
 */
static void pending_user_evts_send(void)
{
    uint8_t i;

    for (i = 0; i < m_num_of_modules_reg; i++)
    {
        // Pass the event to the corresponding event handler.
        m_pending_user_evts[i].evt_handler(&(m_pending_user_evts[i].evt));
    }
    m_pending_usr_evt_index = 0;
}


/**@brief     Function for indicating error to the application.
 *
 * @details   This function will fetch the event handler registered by the application for the
 *            UUID of the service being discovered and send the error code to the application using
 *            the event handler. If no event handler was found, then this function will do nothing.
 *
 * @param[in] p_db_discovery      Pointer to the DB discovery structure.
 * @param[in] err_code            Error code that should be provided to the application.
 *
 */
static void discovery_error_evt_trigger(ble_db_discovery_t * const   p_db_discovery,
                                        uint32_t                     err_code)
{
    ble_db_discovery_evt_handler_t p_evt_handler;
    ble_db_discovery_srv_t *       p_srv_being_discovered;

    p_srv_being_discovered = &(p_db_discovery->services[p_db_discovery->curr_srv_ind]);

    p_evt_handler          = registered_handler_get(&(p_srv_being_discovered->srv_uuid));

    if (p_evt_handler != NULL)
    {
        if (m_pending_usr_evt_index < DB_DISCOVERY_MAX_USERS)
        {
            // Insert a event into the pending event list.
            m_pending_user_evts[m_pending_usr_evt_index].evt.conn_handle     =
                                                                       p_db_discovery->conn_handle;
            m_pending_user_evts[m_pending_usr_evt_index].evt.evt_type        =
                                                                       BLE_DB_DISCOVERY_ERROR;
            m_pending_user_evts[m_pending_usr_evt_index].evt.params.err_code = err_code;
            m_pending_user_evts[m_pending_usr_evt_index].evt_handler         = p_evt_handler;

