oliviertassinari/plume/soft/receiver/ble_sdk_and_doc/ble_sdk_5.2.0/nrf51822/Board/nrf6310/s120/experimental/common/ble_db_discovery.c
            m_pending_usr_evt_index++;

            if (m_pending_usr_evt_index == m_num_of_modules_reg)
            {
                // All modules registered have pending events. Send all pending events to the user
                // modules.
                pending_user_evts_send();
            }
        }
        else
        {
            // Too many events pending. Do nothing. Ideally this should never happen.
        }
    }
}


/**@brief     Function for triggering a Discovery Complete or Service not found event to the
 *            application.
 *
 * @details   This function will fetch the event handler registered by the application for the
 *            UUID of the service being discovered and, using it, trigger an event indicating the
 *            completion of the service discovery. If no event handler was found, then this function
 *            will do nothing.
 *
 * @param[in] p_db_discovery      Pointer to the DB discovery structure.
 * @param[in] is_srv_found        Variable to indicate if the service was found at the peer.
 */
static void discovery_complete_evt_trigger(ble_db_discovery_t * const p_db_discovery,
                                           bool                       is_srv_found)
{
    ble_db_discovery_evt_handler_t  p_evt_handler;
    ble_db_discovery_srv_t *        p_srv_being_discovered;

    p_srv_being_discovered = &(p_db_discovery->services[p_db_discovery->curr_srv_ind]);

    p_evt_handler = registered_handler_get(&(p_srv_being_discovered->srv_uuid));

    if (p_evt_handler != NULL)
    {
        if (m_pending_usr_evt_index < DB_DISCOVERY_MAX_USERS)
        {
            // Insert a event into the pending event list.
            m_pending_user_evts[m_pending_usr_evt_index].evt.conn_handle =
                                                                    p_db_discovery->conn_handle;

            if (is_srv_found)
            {
                m_pending_user_evts[m_pending_usr_evt_index].evt.evt_type             =
                                                                          BLE_DB_DISCOVERY_COMPLETE;

                m_pending_user_evts[m_pending_usr_evt_index].evt.params.discovered_db =
                                                                        *p_srv_being_discovered;
            }
            else
            {
                m_pending_user_evts[m_pending_usr_evt_index].evt.evt_type =
                                                                    BLE_DB_DISCOVERY_SRV_NOT_FOUND;
            }
            m_pending_user_evts[m_pending_usr_evt_index].evt_handler = p_evt_handler;

            m_pending_usr_evt_index++;

            if (m_pending_usr_evt_index == m_num_of_modules_reg )
            {
                // All modules registered have pending events. Send all pending events to the user
                // modules.
                pending_user_evts_send();
            }
            else
            {
                // Too many events pending. Do nothing. Ideally this should never happen.
            }
        }
    }

}


/**@brief     Function for handling service discovery completion.
 *
 * @details   This function will be used to determine if more services to be discovered and if so
 *            initiate the discovery of the next service.
 *
 * @param[in] p_db_discovery Pointer to the DB Discovery Structure.
 */
static void on_srv_disc_completion(ble_db_discovery_t * p_db_discovery)
{
    m_num_of_discoveries_made++;

    // Check if more services need to be discovered.
    if (m_num_of_discoveries_made < m_num_of_modules_reg)
    {
        // Reset the current characteristic index since a fresh service discovery is about to start.
        p_db_discovery->curr_char_ind = 0;

        // Initiate discovery of next service.
        p_db_discovery->curr_srv_ind++;

        ble_db_discovery_srv_t * p_srv_being_discovered;

        p_srv_being_discovered = &(p_db_discovery->services[p_db_discovery->curr_srv_ind]);

        p_srv_being_discovered->srv_uuid =
                                       m_registered_modules[p_db_discovery->curr_srv_ind].srv_uuid;

        // Reset the characteristic count in the current service to zero since a fresh service
        // discovery is about to start.
        p_srv_being_discovered->char_count = 0;

        DB_LOG("[DB]: Starting discovery of service with UUID 0x%x for Connection handle %d\r\n",
                        p_srv_being_discovered->srv_uuid.uuid, p_db_discovery->conn_handle);

        uint32_t err_code;

        err_code = sd_ble_gattc_primary_services_discover
                                              (
                                               p_db_discovery->conn_handle,
                                               SRV_DISC_START_HANDLE,
                                               &(p_srv_being_discovered->srv_uuid)
                                              );
        if (err_code != NRF_SUCCESS)
        {
            p_db_discovery->discovery_in_progress = false;

            // Indicate the error to the user application registered for the service being
            // discovered.
            discovery_error_evt_trigger(p_db_discovery, err_code);

            return;
        }
    }
    else
    {
        // No more service discovery needed.
        p_db_discovery->discovery_in_progress = false;
    }
}


/**@brief     Function for finding out if a characteristic discovery should be performed after the
 *            last discovered characteristic.
 *
 * @details   This function is used during the time of database discovery to find out if there is
 *            a need to do more characteristic discovery. This function uses the value handle of the
 *            last discovered characteristic and compares them with the end handle of the service.
 *            If the latter is greater than one of the former, then it decides that a characteristic
 *            discovery is required.
 *
 * @param[in] p_db_discovery The pointer to the DB Discovery structure.
 * @param[in] p_after_char   The pointer to the last discovered characteristic.
 *
 * @return    True if a characteristic discovery is required. False otherwise.
 */
static bool is_char_discovery_reqd(ble_db_discovery_t * const p_db_discovery,
                                   ble_gattc_char_t *         p_after_char)
{
    if (
        p_after_char->handle_value
        <
        p_db_discovery->services[p_db_discovery->curr_srv_ind].handle_range.end_handle
       )
    {
        // Handle value of the characteristic being discovered is less than the end handle of
        // the service being discovered. There is a possibility of more characteristics being
        // present. Hence a characteristic discovery is required.
        return true;
    }
    return false;
}


/**@brief   Function to find out if a descriptor discovery is required.
 *
 * @details This function finds out if there is a possibility of existence of descriptors between
 *          current characteristic and the next characteristic. If so, this function will compute
 *          the handle range on which the descriptors may be present and will return it.
 *          If the current characteristic is the last known characteristic, then this function will
 *          use the service end handle to find out if the current characteristic can have
 *          descriptors.
 *
 * @param[in]  p_db_discovery    Pointer to the DB Discovery structure.
 * @param[in]  p_curr_char       Pointer to the current characteristic.
 * @param[in]  p_next_char       Pointer to the next characteristic. This should be NULL if the
 *                               caller knows that there is no characteristic after the current
 *                               characteristic at the peer.
 * @param[out] p_handle_range    Pointer to the handle range in which descriptors may exist at the
 *                               the peer.
 *
 * @retval  True if a descriptor discovery is required.
 * @retval  False if a descriptor discovery is NOT required.
 */
static bool is_desc_discovery_reqd(ble_db_discovery_t *       p_db_discovery,
                                   ble_db_discovery_char_t *  p_curr_char,
                                   ble_db_discovery_char_t *  p_next_char,
                                   ble_gattc_handle_range_t * p_handle_range)
{
    if (p_next_char == NULL)
    {
        // Current characteristic is the last characteristic in the service. Check if the value
        // handle of the current characteristic is equal to the service end handle.
        if (
            p_curr_char->characteristic.handle_value
            ==
            p_db_discovery->services[p_db_discovery->curr_srv_ind].handle_range.end_handle
           )
        {
            // No descriptors can be present for the current characteristic. p_curr_char is the last
            // characteristic with no descriptors.
            return false;
        }

        p_handle_range->start_handle = p_curr_char->characteristic.handle_value + 1;
        // Since the current characteristic is the last characteristic in the service, the end
        // handle should be the end handle of the service.
        p_handle_range->end_handle   =
                     p_db_discovery->services[p_db_discovery->curr_srv_ind].handle_range.end_handle;

