oliviertassinari/plume/soft/receiver/ble_sdk_and_doc/ble_sdk_5.2.0/nrf51822/Board/nrf6310/s120/experimental/common/ble_db_discovery.c
        ble_gattc_char_t * p_last_known_char;
        
        p_last_known_char = &(p_srv_being_discovered->charateristics[i - 1].characteristic);

        // If no more characteristic discovery is required OR if the maximum number of supported
        // characteristic per service has been reached, perform descriptor discovery.
        if (
            !is_char_discovery_reqd(p_db_discovery, p_last_known_char)
            ||
            (p_srv_being_discovered->char_count == BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV)
           )
        {
            perform_desc_discov = true;
        }
        else
        {
            // Update the current characteristic index.
            p_db_discovery->curr_char_ind = p_srv_being_discovered->char_count;

            // Perform another round of characteristic discovery.
            err_code = characteristics_discover(p_db_discovery);

            if (err_code != NRF_SUCCESS)
            {
                p_db_discovery->discovery_in_progress = false;

                discovery_error_evt_trigger(p_db_discovery, err_code);

                return;
            }
        }
    }
    else // p_ble_gattc_evt->gatt_status != BLE_GATT_STATUS_SUCCESS
    {
        // The previous characteristic discovery resulted in no characteristics. Hence
        // descriptor discovery should be performed.
        perform_desc_discov = true;
    }

    if (perform_desc_discov)
    {
        bool raise_discov_complete;

        p_db_discovery->curr_char_ind = 0;

        err_code = descriptors_discover(p_db_discovery, &raise_discov_complete);

        if (err_code != NRF_SUCCESS)
        {
            p_db_discovery->discovery_in_progress = false;

            discovery_error_evt_trigger(p_db_discovery, err_code);

            return;
        }
        if (raise_discov_complete)
        {
            // No more characteristics and descriptors need to be discovered. Discovery is complete.
            // Send a discovery complete event to the user application.
            DB_LOG("[DB]: Discovery of service with UUID 0x%x completed with success for Connection"
                           " handle %d\r\n", p_srv_being_discovered->srv_uuid.uuid,
                           p_db_discovery->conn_handle);

            discovery_complete_evt_trigger(p_db_discovery, true);

            on_srv_disc_completion(p_db_discovery);
        }
    }
}


/**@brief   Function for handling descriptor discovery response.
 *
 * @param[in] p_db_discovery    Pointer to the DB Discovery structure.
 * @param[in] p_ble_gattc_evt   Pointer to the GATT Client event.
 */
static void on_desc_disc_rsp(ble_db_discovery_t * const     p_db_discovery,
                             const ble_gattc_evt_t * const  p_ble_gattc_evt)
{
    const ble_gattc_evt_desc_disc_rsp_t * p_desc_disc_rsp_evt;
    ble_db_discovery_srv_t *              p_srv_being_discovered;

    p_srv_being_discovered = &(p_db_discovery->services[p_db_discovery->curr_srv_ind]);

    p_desc_disc_rsp_evt = &(p_ble_gattc_evt->params.desc_disc_rsp);

    ble_db_discovery_char_t * p_char_being_discovered =
              &(p_srv_being_discovered->charateristics[p_db_discovery->curr_char_ind]);

    if (p_ble_gattc_evt->gatt_status == BLE_GATT_STATUS_SUCCESS)
    {
        // The descriptor was found at the peer.
        // If the descriptor was a CCCD, then the cccd_handle needs to be populated.

        uint8_t i;

        // Loop through all the descriptors to find the CCCD.
        for (i = 0; i < p_desc_disc_rsp_evt->count; i++)
        {
            if (
                p_desc_disc_rsp_evt->descs[i].uuid.uuid
                ==
                BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG
               )
            {
                p_char_being_discovered->cccd_handle = p_desc_disc_rsp_evt->descs[i].handle;

                break;
            }
        }
    }

    bool raise_discov_complete = false;

    if ((p_db_discovery->curr_char_ind + 1) == p_srv_being_discovered->char_count)
    {
        // No more characteristics and descriptors need to be discovered. Discovery is complete.
        // Send a discovery complete event to the user application.

        raise_discov_complete = true;
    }
    else
    {
        // Begin discovery of descriptors of the next characteristic.
        uint32_t err_code;

        p_db_discovery->curr_char_ind++;

        err_code = descriptors_discover(p_db_discovery, &raise_discov_complete);

        if (err_code != NRF_SUCCESS)
        {
            p_db_discovery->discovery_in_progress = false;

            // Indicate the error to the user application registered for the service being
            // discovered.
            discovery_error_evt_trigger(p_db_discovery, err_code);

            return;
        }
    }

    if (raise_discov_complete)
    {
        DB_LOG("[DB]: Discovery of service with UUID 0x%x completed with success for Connection"
                              "handle %d\r\n", p_srv_being_discovered->srv_uuid.uuid,
                              p_db_discovery->conn_handle);

        discovery_complete_evt_trigger(p_db_discovery, true);

        on_srv_disc_completion(p_db_discovery);
    }
}


uint32_t ble_db_discovery_init(ble_db_discovery_init_t * p_db_discovery_init)
{
    if (p_db_discovery_init == NULL)
    {
        return NRF_ERROR_NULL;
    }

    m_num_of_modules_reg      = 0;
    m_initialized             = true;
    m_num_of_discoveries_made = 0;
    m_pending_usr_evt_index   = 0;

    return NRF_SUCCESS;
}


uint32_t ble_db_discovery_close()
{
    m_num_of_modules_reg      = 0;
    m_initialized             = false;
    m_num_of_discoveries_made = 0;
    m_pending_usr_evt_index   = 0;

    return NRF_SUCCESS;
}


uint32_t ble_db_discovery_register(const ble_uuid_t * const              p_uuid,
                                   const ble_db_discovery_evt_handler_t  evt_handler)
{
    if ((p_uuid == NULL) || (evt_handler == NULL))
    {
        return NRF_ERROR_NULL;
    }

    if (!m_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (m_num_of_modules_reg == DB_DISCOVERY_MAX_USERS)
    {
        // The limit on the maximum number of users supported has reached. Return error.
        return NRF_ERROR_NOT_SUPPORTED;
    }

